pwbf/RX64M_CANBUS/can_api_demo.c

#include "can_api_demo.h"
#include "platform.h"
#include <machine.h>
#include "r_can_rx_if.h"
#include "r_can_rx_config.h"
#include <stdio.h>


/* TEST CAN ID */
#if (FRAME_ID_MODE == STD_ID_MODE)
    #define     TX_CANID_DEMO_INIT  	(0x0A0)    // Max 0x7FF if Standard ID.
    #define     RX_CANID_DEMO_INIT     	(0x0A1)    // "-
#else
    #define     TX_CANID_DEMO_INIT     	(uint32_t)(0x000A0000)    ///Max 0x20000000 if Extended CAN ID.
    #define     RX_CANID_DEMO_INIT     	(uint32_t)(0x000A0001)    // "-
#endif

#ifdef CAN2 // Three CAN channels exist on device.
    #define     NR_CAN_CHANNELS             (3)
#else
#ifdef CAN1 // Two CAN channels exist.
    #define     NR_CAN_CHANNELS             (2)
#else       // One CAN channel.
    #define     NR_CAN_CHANNELS             (1)
#endif
#endif

#define     NR_STARTUP_TEST_FRAMES      (99)
#define     NR_LOOPS_RESET_LEDS         (0x00020000)
#define     LED_DELAY                   (0x00200000)

#define     REMOTE_DEMO_ENABLE          (0)   /* 1 on, 0 off. */
#define     REMOTE_TEST_ID              (0x050)

/* Use this to aid in diagnose of problematic CAN bus.
 * Do *NOT* use in production unless error diagnostics is desired in end product.
 * Observe that CAN recovers by itself if things return to mormal, and
 * CAN bus states Error Passive and Bus Off are handled by handle_can_bus_state(). */
#define     ERROR_DIAG                  (0)   /* 1 on, 0 off. USE_CAN_POLL must be 0 if on. */

/***********************************************************************************************************************
 * Exported global variables
************************************************************************************************************************/
/* Demo data */
can_frame_t  tx_dataframe, tx_data, rx_dataframe, remote_frame;

/* RSK+ 64M uses CAN0 (channel 0). */
uint32_t    g_can_channel = CH_0;

/* Flags set by the CAN ISRs, so the user app knows it has data tp process.
 * Polled mode will poll the mailboxes instead. */
#if !USE_CAN_POLL
uint32_t    CAN0_tx_sentdata_flag = 0;
uint32_t    CAN0_rx_newdata_flag = 0;
uint32_t    CAN0_tx_remote_sentdata_flag = 0;
uint32_t    CAN0_rx_remote_frame_flag = 0;
#endif

/* Application layer logic error container. Use as desired to record issues. */
enum app_err_enum   app_err_nr;

/***********************************************************************************************************************
Global variables and functions imported (externs)
***********************************************************************************************************************/
/* Data */
/* Functions */

extern void   read_switches(void);

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
/* Errors. Peripheral and bus errors. Space for each channel. */
static uint32_t error_bus_status[NR_CAN_CHANNELS];
static uint32_t error_bus_status_prev[NR_CAN_CHANNELS];
static uint32_t can_state[NR_CAN_CHANNELS];
static uint32_t nr_times_reached_busoff[NR_CAN_CHANNELS];

/* Counts demo frames sent and received. */
static uint32_t nr_frames_rx = 0, nr_frames_tx = 0;

/* Functions */
static uint32_t init_can_app(void);
static void     check_can_errors(void);
static void     handle_can_bus_state(uint8_t ch_nr);

#if USE_CAN_POLL
 static void    can_poll_demo(void);
#else
 static void can_int_demo(void);
 static void my_can_tx0_callback(void);
 static void my_can_rx0_callback(void);
 static void my_can_err0_callback(void);
#endif

/***********************************************************************************************************************
Function name:  main
Parameters:     -
Returns:        -
Description:    Main Can API demo program. See top of file.
***********************************************************************************************************************/

uint8_t rtn = 0;
void main(void)
{
    uint32_t  api_status = R_CAN_OK;

    #if BSP_CFG_IO_LIB_ENABLE
        printf("\n\nStarting Tx-Rx Demo...\n");
        printf("R_CAN_Create() for channel %d, and provided user callback funcs.\n", g_can_channel);
    #endif


    /* Init CAN. */
    #if USE_CAN_POLL
        api_status = R_CAN_Create(g_can_channel, NULL, NULL, NULL);
    #else
        api_status = R_CAN_Create(g_can_channel, my_can_tx0_callback, my_can_rx0_callback, my_can_err0_callback);
    #endif

    if (api_status != R_CAN_OK)
    {
        /* An error at this stage is fatal to demo, so stop here. */
        #if BSP_CFG_IO_LIB_ENABLE
            printf("Demo init error.\n\n");
        #endif
        while (1)
        {
			return 1;
            /* Stop here and leave error displayed. */
        }
    }
	
    /****************************************
    * Pick ONE R_CAN_PortSet call below!    *
    *****************************************/
    /* Normal CAN bus usage. */
    //api_status = R_CAN_PortSet(g_can_channel, CAN_OPERATION);
    api_status = R_CAN_PortSet(g_can_channel, CAN_RESET);
	api_status |= init_can_app();
    /* Initialize CAN mailboxes, and setup the demo receive and transmit dataframe variables. */
    //api_status |= init_can_app();

    /* Is all OK after all CAN initialization? */
    if (api_status != R_CAN_OK)
    {
        api_status = R_CAN_OK;
        app_err_nr = APP_ERR_CAN_INIT;
    }

	printf("Before RxSet\n");
	/*R_CAN_RxSet(g_can_channel, CANBOX(1), 0x0001, DATA_FRAME);
	R_BSP_SoftwareDelay(100, BSP_DELAY_MILLISECS);*/
	rtn = R_CAN_RxSet(g_can_channel, CANBOX(2), 0x0002, DATA_FRAME);
	//rtn = R_CAN_RxSet(g_can_channel, CANBOX(2), 0x0002, REMOTE_FRAME);
	switch(rtn){
	   	case R_CAN_OK:
			printf("R_CAN_RxSet>> R_CAN_OK\n");
			break;
	   	case R_CAN_SW_BAD_MBX:
			printf("R_CAN_RxSet>> R_CAN_SW_BAD_MBX\n");
			break;
	   	case R_CAN_BAD_CH_NR:
			printf("R_CAN_RxSet>> R_CAN_BAD_CH_NR\n");
			break;
	   	case R_CAN_SW_SET_TX_TMO:
			printf("R_CAN_RxSet>> R_CAN_SW_SET_TX_TMO\n");
			break;
	   	case R_CAN_SW_SET_RX_TMO:
			printf("R_CAN_RxSet>> R_CAN_SW_SET_RX_TMO\n");
			break;
	   }
	
	/*R_BSP_SoftwareDelay(100, BSP_DELAY_MILLISECS);
	R_CAN_RxSetMask(g_can_channel, CANBOX(2), 0x000);
	R_BSP_SoftwareDelay(100, BSP_DELAY_MILLISECS);*/
	//can_int_demo();
	printf("After RxSet");
	printf("\n");

