pwbf/RX64M_CANBUS/can_api_demo.c
    /*  M A I N  L O O P  * * * * * * * * * * * * * * * * * * * * * * * */
    PORT2.PDR.BIT.B6 = 1;
    
    while(1)
    {
	   /*
	   PORT2.PODR.BIT.B6 = 0;
	   R_BSP_SoftwareDelay(100, BSP_DELAY_MILLISECS);
	   PORT2.PODR.BIT.B6 = 1;
	   R_BSP_SoftwareDelay(100, BSP_DELAY_MILLISECS);
	   */
	   
	   rtn = R_CAN_RxPoll(g_can_channel, CANBOX(2));
	   PORTE.PODR.BIT.B1 = 0;
	   switch(rtn){
	   	case R_CAN_OK:
			printf("R_CAN_RxPoll>> R_CAN_OK\n");
			PORTE.PODR.BIT.B4 = 0;
			break;
	   	case R_CAN_NOT_OK:
			printf("R_CAN_RxPoll>> R_CAN_NOT_OK\n");
			PORTE.PODR.BIT.B3 = 0;
			break;
	   	case R_CAN_RXPOLL_TMO:
			printf("R_CAN_RxPoll>> R_CAN_RXPOLL_TMO\n");
			PORTE.PODR.BIT.B2 = 0;
			break;
	   	case R_CAN_SW_BAD_MBX:
			printf("R_CAN_RxPoll>> R_CAN_SW_BAD_MBX\n");
			//PORTE.PODR.BIT.B1 = 0;
			break;
	   	case R_CAN_BAD_CH_NR:
			printf("R_CAN_RxPoll>> R_CAN_BAD_CH_NR\n");
			PORTE.PODR.BIT.B1 = 0;
			PORTE.PODR.BIT.B2 = 0;
			PORTE.PODR.BIT.B3 = 0;
			PORTE.PODR.BIT.B4 = 0;
			break;
	   }
	   R_BSP_SoftwareDelay(50, BSP_DELAY_MILLISECS);
			PORTE.PODR.BIT.B2 = 1;
			PORTE.PODR.BIT.B3 = 1;
			PORTE.PODR.BIT.B4 = 1;
	   R_BSP_SoftwareDelay(50, BSP_DELAY_MILLISECS);
	   
    }
}/* end main() */


#if USE_CAN_POLL
/*****************************************************************************
Function name:  can_poll_demo
Parameters:     -
Returns:        -
Description:    POLLED CAN demo version
*****************************************************************************/
static void can_poll_demo(void)
{
    uint32_t    api_status = R_CAN_OK;

    /*** TRANSMITTED any frames? */
    api_status = R_CAN_TxCheck(g_can_channel, CANBOX_TX);
    if (api_status == R_CAN_OK)
    {
        nr_frames_tx++;
        LED1 = LED_ON;
        #if BSP_CFG_IO_LIB_ENABLE
            printf("TxChk OK\n");
            printf("Sent frame. nr_frames_tx = %d.\n", nr_frames_tx);
        #endif
    }

    /* Since we are always polling for transmits, api_status for R_CAN_TxCheck
      will most often be other than R_CAN_OK, don't show that in this demo.*/

    /*** RECEIVED any frames? */
    api_status = R_CAN_RxPoll(g_can_channel, CANBOX_RX);
    if (api_status == R_CAN_OK)
    {
        nr_frames_rx++;
        LED0 = LED_ON;

        /* Read CAN data and show. */
        api_status = R_CAN_RxRead(g_can_channel, CANBOX_RX, &rx_dataframe);

        /* You can set BP here and check the received data in debugger. */
        R_BSP_NOP();

        #if BSP_CFG_IO_LIB_ENABLE
            printf("Received CAN ID 0x%X, nr_frames_rx = %d.\n", rx_dataframe.id, nr_frames_rx);
        #endif
        if (api_status == R_CAN_MSGLOST)
        {
            #if BSP_CFG_IO_LIB_ENABLE
                printf( "MSGLOST\n");
            #endif
            R_BSP_NOP();
        }
    }
}/* end can_poll_demo() */

#else

/*****************************************************************************
Function name:      can_int_demo
Parameters:         -
Returns:            -
Description:        INTERRUPT driven CAN demo version.
*****************************************************************************/
static void can_int_demo(void)
{
    uint32_t    api_status = R_CAN_OK;

    /*** TRANSMITTED any frames? Only need to check if flag is set by CAN Tx ISR. */
    if (CAN0_tx_sentdata_flag)
    {
        CAN0_tx_sentdata_flag = 0;
        LED1 = LED_ON;
        nr_frames_tx++;
        #if BSP_CFG_IO_LIB_ENABLE
            printf("Sent frame. nr_frames_tx = %d.\n", nr_frames_tx);
        #endif
    }

    /*** RECEIVED any frames? Only need to check if flag is set by CAN Rx ISR.
     Will only receive own frames in CAN port test modes 0 and 1. */
    if (CAN0_rx_newdata_flag)
    {
        CAN0_rx_newdata_flag = 0;
        LED0 = LED_ON;
        nr_frames_rx++;

        /* Read CAN data and show. */
        api_status = R_CAN_RxRead(g_can_channel, CANBOX_RX, &rx_dataframe);

        /* You can set BP here and check the received data in debugger. */
        R_BSP_NOP();

        #if BSP_CFG_IO_LIB_ENABLE
            printf("Received CAN ID 0x%X, nr_frames_rx = %d.\n", rx_dataframe.id, nr_frames_rx);
        #endif

        if (api_status == R_CAN_MSGLOST)
        {
            #if BSP_CFG_IO_LIB_ENABLE
                printf( "MSGLOST\n\n");
            #endif
            R_BSP_NOP();
        }
    }

    #if REMOTE_DEMO_ENABLE
    /* Previous remote reply succeeded? */
    if (CAN0_tx_remote_sentdata_flag)
    {
        CAN0_tx_remote_sentdata_flag = 0;
        #if BSP_CFG_IO_LIB_ENABLE
            printf( "Remote trig.\n");
        #endif
    }

    /* Set up remote reply if remote request came in. */
    if (CAN0_rx_remote_frame_flag == 1)
    {
        CAN0_rx_remote_frame_flag = 0;
        remote_frame.data[0]++;

        if (FRAME_ID_MODE == STD_ID_MODE )
        {
        	api_status |= R_CAN_TxSet(g_can_channel, CANBOX_REMOTE_TX, &remote_frame, DATA_FRAME);
        }
        else
        {
        	api_status |= R_CAN_TxSetXid(g_can_channel, CANBOX_REMOTE_TX, &remote_frame, DATA_FRAME);
        }
    }
    #endif
}/* end can_int_demo() */
#endif

/*****************************************************************************
Function name:  init_can_app
Parameters:     -
Returns:        -
Description:    Initialize CAN mailboxes, and setup the demo receive and trans-
                mit dataframe variables. See top of file for demo description.
                After startup, user calls to transmit demo frame done by SW1Func()
                in file switches.c.
*****************************************************************************/
static uint32_t init_can_app(void)
{
    uint32_t    api_status = R_CAN_OK;
    uint8_t     i;

    can_state[0] = R_CAN_STATUS_ERROR_ACTIVE;

    /* Initialize status for all channels. */
    for (i = 0; i < NR_CAN_CHANNELS; i++)
    {
        error_bus_status[i] = R_CAN_STATUS_ERROR_ACTIVE;
        error_bus_status_prev[i] = R_CAN_STATUS_ERROR_ACTIVE;
    }

    /******** Init demo to receive data ********/
    /* Use API to set one CAN mailbox for demo receive. */
    /* Standard id. Choose value 0-0x07FF (2047). */
    if (FRAME_ID_MODE == STD_ID_MODE)
    {
        api_status |= R_CAN_RxSet(g_can_channel, CANBOX_RX, RX_CANID_DEMO_INIT, DATA_FRAME);

