pwbf/RX64M_CANBUS/can_api_demo.c
        /* Clear interrupt. */
        CLR(CAN1, ERS1) = 1;
    }
}/* end my_can_err1_callback() */
#endif

#if(0)
#ifdef CAN2
/*****************************************************************************
Function Name:  my_can_err2_callback
Parameters:     -
Returns:        -
Description:    CAN2 Error interrupt.
*****************************************************************************/
static void my_can_err2_callback(void)
{
    /* Error interrupt can have multiple sources. Check interrupt flags to id source. */
    if (IS(CAN2, ERS2))
    {
        #if ERROR_DIAG
            uint8_t         err_int_factor, errcode_store;
            static uint8_t  err_int_factor_accumulate, errcode_store_accumulate;

            LED3 = LED_ON;

            /* Cause identification. */
            err_int_factor = CAN2.EIFR.BYTE;
            err_int_factor_accumulate |= CAN2.EIFR.BYTE;
            errcode_store = CAN2.ECSR.BYTE;
            errcode_store_accumulate |= CAN2.ECSR.BYTE;

            /* Clear EIFR and ECSR. Do a byte-write to avoid read-modify-write with HW writing another bit inbetween. (HW manual says
             * "When a single bit is set to 0 by a program, do not use the logic operation instruction (AND) ??use the transfer
             * instruction (MOV) to ensure that only the specified bit is set to 0 and the other bits are set to 1. Writing 1
             * has no effect to these bit values.)" */
            CAN2.EIFR.BYTE = 0;
            CAN2.ECSR.BYTE = 0;

            #if BSP_CFG_IO_LIB_ENABLE
                printf("CAN2 error diag: \nerr_int_factor 0x%X, accumulated value 0x%X\n", err_int_factor, err_int_factor_accumulate);
                printf("errcode_store 0x%X, accumulated value 0x%X\n", errcode_store, errcode_store_accumulate);
            #endif
        #endif //ERROR_DIAG

        /* Set BP here to catch cause. */
        R_BSP_NOP();

        /* Clear interrupt. */
        CLR(CAN2, ERS2) = 1;
    }
}/* end my_can_err2_callback() */
#endif
#endif
#endif  //USE_CAN_POLL

